project04/app/controllers/articles_controller.rb

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("created_at", "title", "author_name", "body", "number_of_edits", "updated_at") VALUES('2011-02-07 15:33:31', 'Why I love lifehacker', 'ANdy Niccolai', 'Welcome to the new Lifehacker. Things look a little bit different around here today, but we think it''s a big improvement. Here''s why.

  def update
    @article = Article.find(params[:id])

    @article.increment_edits
---
SELECT * FROM "articles" WHERE ("articles"."id" = 5)
UPDATE "articles" SET "updated_at" = '2011-02-06 22:42:43', "number_of_edits" = 1, "body" = 'esdfsdf' WHERE "id" = 5